public class Task4 {
    public static void main(String[] args) {
        /*
        1. Создайте множество, в котором будут храниться экземпляры классы Cat - HashSet<Cat>
        Поместите в него некоторое количество объектов.
        2. Создайте 2 или более котов с одинаковыми параметрами в полях. Поместите их во множество.
        Убедитесь, что все они сохранились во множество.
        3. Создайте метод public boolean equals(Object o)
        Пропишите в нем логику сравнения котов по параметрам в полях.
        То есть, метод должен возвращать true, только если значения во всех полях сравниваемого объекта равны.
        4. Выведите снова содержимое множества из пункта 2, убедитесь, что дубликаты удалились.
         */
    }
}
