public class DataStructure {
    public static void main(String[] args) {
        /*
        Создать структуру данных для хранения номеров паспортов и фамилий сотрудников организации.
        123456 Иванов
        321456 Васильев
        234561 Петрова
        234432 Иванов
        654321 Петрова
        345678 Иванов
        Вывести данные по сотрудникам с фамилией Иванов

        Задача будет решаться через отдельный класс

        *** Для выделения и копирования только номеров -> устанавливаем курсор на нужном месте
        зажимаем Alt, мышкой растягиваем курсор до необходимого места, копируем. Вставляем
        в другое место таким же образом.
         */

        Office office = new Office(); // Office - тип данных (тип ссылки), office - имя переменной(имя ссылки),
        // new Office - какой объект будет создан(создание объекта).
        office.add("123456", "Иванов");
        office.add("321456", "Васильев");
        office.add("234561", "Петрова");
        office.add("234432", "Иванов");
        office.add("654321", "Петрова");
        office.add("345678", "Иванов");

        System.out.println(office.getByLastName("Иванов"));
        System.out.println(office.getAllList2());

    }
}
